# GetAllLoadedItemFiles Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricationConfiguration..::..GetAllLoadedItemFiles Method
FabricationConfiguration Class See Also
---
Get list of all loaded fabrication item files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationItemFile> GetAllLoadedItemFiles()
```

Visual Basic
---
```text
Public Function GetAllLoadedItemFiles As IList(Of FabricationItemFile)
```

Visual C++
---
```text
public:
IList<FabricationItemFile^>^ GetAllLoadedItemFiles()
```

# ### Return Value
Returns the loaded fabrication item files.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The fabrication configuration is not set yet. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace